In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
%matplotlib inline

In [2]:
df1 = pd.read_csv(r'../datasets/cleaned_test.csv',index_col=0)
df2 = pd.read_csv(r'../datasets/gender_submission.csv',index_col=0)

In [3]:
df1.head()

,Pclass,Age,SibSp,Parch,Fare,Name,Sex,Ticket,Embarked
PassengerId,,,,,,,,,
892,3,34.500000,0.0,0.0,7.8292,"Kelly, Mr. James",male,330911,Q
893,3,47.000000,1.0,0.0,7.0000,"Wilkes, Mrs. James (Ellen Needs)",female,363272,S
894,2,29.155609,0.0,0.0,9.6875,"Myles, Mr. Thomas Francis",male,240276,Q
895,3,27.000000,0.0,0.0,8.6625,"Wirz, Mr. Albert",male,315154,S
896,3,22.000000,1.0,0.0,12.2875,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,3101298,S

In [4]:
df1.shape

(418, 9)

In [5]:
print(f"Number of missing values = {df1.isna().sum().sum()}")
print(f"Number of duplicates = {df1.duplicated().sum()}")

Number of missing values = 0
Number of duplicates = 0

In [6]:
df1.describe()

           Pclass         Age       SibSp  Parch        Fare
count  418.000000  418.000000  418.000000  418.0  418.000000
mean     2.265550   29.155609    0.339066    0.0   18.309602
std      0.841838    9.018171    0.534670    0.0   13.396204
min      1.000000    5.000000    0.000000    0.0    0.000000
25%      1.000000   24.000000    0.000000    0.0    7.895800
50%      3.000000   29.155609    0.000000    0.0   14.454200
75%      3.000000   31.000000    1.000000    0.0   23.000000
max      3.000000   54.000000    2.000000    0.0   65.000000

In [7]:
df2.head()

             Survived
PassengerId
892                 0
893                 1
894                 0
895                 0
896                 1

In [8]:
df2.shape

(418, 1)

In [9]:
#Merging the two data sets
titanic = pd.merge(df1,df2,left_index=True,right_index=True)
titanic.head()

,Pclass,Age,SibSp,Parch,Fare,Name,Sex,Ticket,Embarked,Survived
PassengerId,,,,,,,,,,
892,3,34.500000,0.0,0.0,7.8292,"Kelly, Mr. James",male,330911,Q,0
893,3,47.000000,1.0,0.0,7.0000,"Wilkes, Mrs. James (Ellen Needs)",female,363272,S,1
894,2,29.155609,0.0,0.0,9.6875,"Myles, Mr. Thomas Francis",male,240276,Q,0
895,3,27.000000,0.0,0.0,8.6625,"Wirz, Mr. Albert",male,315154,S,0
896,3,22.000000,1.0,0.0,12.2875,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,3101298,S,1

In [10]:
print(f"Number of missing values = {titanic.isna().sum().sum()}")
print(f"Number of duplicates = {titanic.duplicated().sum()}")

Number of missing values = 0
Number of duplicates = 0

# Pclass Statistics

In [11]:
print(f'Mean = {titanic["Pclass"].mean()}')
print(f'Median = {titanic["Pclass"].median()}')
print(f'Standard Deviation = {titanic["Pclass"].std()}')
print(f'Mode = {titanic["Pclass"].mode()}')

Mean = 2.2655502392344498
Median = 3.0
Standard Deviation = 0.8418375519640503
Mode = 0    3
Name: Pclass, dtype: int64

In [12]:
titanic['Pclass'].describe()

count    418.000000
mean       2.265550
std        0.841838
min        1.000000
25%        1.000000
50%        3.000000
75%        3.000000
max        3.000000
Name: Pclass, dtype: float64

# Age Statistics

In [13]:
print(f'Mean = {titanic["Age"].mean()}')
print(f'Median = {titanic["Age"].median()}')
print(f'Standard Deviation = {titanic["Age"].std()}')
print(f'Mode = {titanic["Age"].mode()}')

Mean = 29.155609348388317
Median = 29.15560934838832
Standard Deviation = 9.018170568083795
Mode = 0    30.27259
Name: Age, dtype: float64

In [14]:
titanic['Age'].describe()

count    418.000000
mean      29.155609
std        9.018171
min        5.000000
25%       24.000000
50%       29.155609
75%       31.000000
max       54.000000
Name: Age, dtype: float64

# SibSp Statistics

In [15]:
print(f'Mean = {titanic["SibSp"].mean()}')
print(f'Median = {titanic["SibSp"].median()}')
print(f'Standard Deviation = {titanic["SibSp"].std()}')
print(f'Mode = {titanic["SibSp"].mode()}')

Mean = 0.3390663390663391
Median = 0.0
Standard Deviation = 0.5346704877556335
Mode = 0    0.0
Name: SibSp, dtype: float64

In [16]:
titanic['SibSp'].describe()

count    418.000000
mean       0.339066
std        0.534670
min        0.000000
25%        0.000000
50%        0.000000
75%        1.000000
max        2.000000
Name: SibSp, dtype: float64

# Parch Statistics

In [17]:
print(f'Mean = {titanic["Parch"].mean()}')
print(f'Median = {titanic["Parch"].median()}')
print(f'Standard Deviation = {titanic["Parch"].std()}')
print(f'Mode = {titanic["Parch"].mode()}')

Mean = 0.0
Median = 0.0
Standard Deviation = 0.0
Mode = 0    0.0
Name: Parch, dtype: float64

In [18]:
titanic['Parch'].describe()

count    418.0
mean       0.0
std        0.0
min        0.0
25%        0.0
50%        0.0
75%        0.0
max        0.0
Name: Parch, dtype: float64

# Fare Statistics

In [19]:
print(f'Mean = {titanic["Fare"].mean()}')
print(f'Median = {titanic["Fare"].median()}')
print(f'Standard Deviation = {titanic["Fare"].std()}')
print(f'Mode = {titanic["Fare"].mode()}')

Mean = 18.309601896664486
Median = 14.4542
Standard Deviation = 13.39620407203089
Mode = 0    18.309602
Name: Fare, dtype: float64

In [20]:
titanic['Fare'].describe()

count    418.000000
mean      18.309602
std       13.396204
min        0.000000
25%        7.895800
50%       14.454200
75%       23.000000
max       65.000000
Name: Fare, dtype: float64